# Напишите функцию number_to_words(num), которая принимает
# в качестве аргумента натуральное число num и возвращает
# его словесное описание на русском языке.
#
# Примечание 1.
# Считайте, что число 1 ≤ num ≤ 99.
#
# Примечание 2.
# Следующий программный код:
#
# print(number_to_words(7))
# print(number_to_words(85))
# должен выводить:
#
# семь
# восемьдесят пять
num=int(input())
def number_to_words(num):
    if num==1:
        print("один")
    if num==2:
        print("два")
    if num==3:
        print("три")
    if num==4:
        print("четыре")
    if num==5:
        print("пять")
    if num==6:
        print("шесть")
    if num==7:
        print("семь")
    if num==8:
        print("восемь")
    if num==9:
        print("девять")
    if num==10:
        print("десять")
    if num==11:
        print("одиннадцать")
    if num==12:
        print("двенадцать")
    if num==13:
        print("тринадцать")
    if num==14:
        print("четырнадцать")
    if num==15:
        print("пятнадцать")
    if num==16:
        print("шестнадцать")
    if num==17:
        print("семнадцать")
    if num==18:
        print("восемнадцать")
    if num==19:
        print("девятнадцать")
    if num==20:
        print("двадцать")
    if num==20:
        print("двадцать один")
    if num==22:
        print("двадцать два")
    if num==23:
        print("двадцать три")
    if num==24:
        print("двадцать четыре")
    if num==25:
        print("двадцать пять")
    if num==26:
        print("двадцать шесть")
    if num==27:
        print("двадцать семь")
    if num==28:
        print("двадцать восемь")
    if num==29:
        print("двадцать девять")
    if num==30:
        print("тридцать")
    if num==31:
        print("тридцать один")
    if num==32:
        print("тридцать два")
    if num==33:
        print("тридцать три")
    if num==34:
        print("тридцать четыре")
    if num==35:
        print("тридцать пять")
    if num==36:
        print("тридцать шесть")
    if num==37:
        print("тридцать семь")
    if num==38:
        print("попугаев")
    if num==39:
        print("тридцать девять")
    if num==40:
        print("сорок")
    if num==41:
        print("сорок один")
    if num==42:
        print("сорок два")
    if num==43:
        print("сорок три")
    if num==44:
        print("сорок четыре")
    if num==45:
        print("сорок пять")
    if num==46:
        print("сорок шесть")
    if num==47:
        print("сорок семь")
    if num==48:
        print("сорок восемь")
    if num==49:
        print("сорок девять")
    if num==50:
        print("пятьдесят")
    if num==51:
        print("пятьдесят один")
    if num==52:
        print("пятьдесят два")
    if num==53:
        print("пятьдесят три")
    if num==54:
        print("Новосибирская область")
    if num==55:
        print("пятьдесят пять")
    if num==56:
        print("пятьдесят шесть")
    if num==57:
        print("пятьдесят семь")
    if num==58:
        print("пятьдесят восемь")
    if num==59:
        print("пятьдесят девять")
    if num==60:
        print("шестьдесят")
    if num==61:
        print("шестьдесят один")
    if num==62:
        print("шестьдесят два")
    if num==63:
        print("шестьдесят три")
    if num==64:
        print("шестьдесят четыре")
    if num==65:
        print("шестьдесят пять")
    if num==66:
        print("шестьдесят шесть")
    if num==67:
        print("шестьдесят семь")
    if num==68:
        print("шестьдесят восемь")
    if num==69:
        print("шестьдесят девять")
    if num==70:
        print("семьдесят")
    if num==71:
        print("семьдесят один")
    if num==72:
        print("семьдесят два")
    if num==73:
        print("семьдесят три")
    if num==74:
        print("семьдесят четыре")
    if num==75:
        print("семьдесят пять")
    if num==76:
        print("семьдесят шесть")
    if num==77:
        print("семьдесят семь")
    if num==78:
        print("семьдесят восемь")
    if num==79:
        print("золото")
    if num==80:
        print("восемьдесят")
    if num==81:
        print("восемьдесят один")
    if num==82:
        print("восемьдесят два")
    if num==83:
        print("восемьдесят три")
    if num==84:
        print("восемьдесят четыре")
    if num==85:
        print("восемьдесят пять")
    if num==86:
        print("восемьдесят шесть")
    if num==87:
        print("восемьдесят семь")
    if num==88:
        print("восемьдесят восемь")
    if num==89:
        print("восемьдесят девять")
    if num==90:
        print("девяносто")
    if num==91:
        print("девяносто один")
    if num==92:
        print("девяносто два")
    if num==93:
        print("девяносто три")
    if num==94:
        print("девяносто четыре")
    if num==95:
        print("девяносто пять")
    if num==96:
        print("девяносто шесть")
    if num==97:
        print("девяносто семь")
    if num==98:
        print("ещё одно число...")
    if num==99:
        print("девяносто девять")
number_to_words(num)